{
  "7323257898052662520": {
    "name": "Sweet Water Golf Course",
    "main_image": "https://workhorsetour.com/images/Sweet%20Water/SweetWater_No2.jpg",
    "images": [
      "https://workhorsetour.com/images/Sweet%20Water/SweetWater_No3.jpg",
      "https://workhorsetour.com/images/Sweet%20Water/SweetWater_No4.jpg",
      "https://workhorsetour.com/images/Sweet%20Water/SweetWater_No4.jpg",
      "https://workhorsetour.com/images/Sweet%20Water/SweetWater_No6.jpg"
    ],
    "description": "Sweet Water CC is our second 9-hole course on tour and is a great spot to work out the kinks in your game as we approach the final stretch of the Tour season. Measuring 2777 yards from the men's tees, this par-36 includes two par fives, with one of them being the 475-yard 4th hole. A stream and two ponds affect play on three holes with the water feature poised to wreak havoc on #2, a short par-4 with ponds both in front and in back of the green.",
    "round_id": ["7323425486569256297"]
  },
  "7323237965612758263": {
    "name": "Radnor Valley Country Club",
    "main_image": "https://workhorsetour.com/images/Radnor%20Valley/RadnorValley_No13.jpg",
    "images": [
      "https://workhorsetour.com/images/Radnor%20Valley/RadnorValley_No16.jpg",
      "https://workhorsetour.com/images/Radnor%20Valley/RadnorValley_No3.jpg",
      "https://workhorsetour.com/images/Radnor%20Valley/RadnorValley_No9.jpg"
    ],
    "description": "Our green grass season wraps up with a one day member event at this gem in Villanova. The 18-hole course features 6,562 yards of golf from the longest tees playing to a par-70. Designed by Dick Wilson, the Radnor Valley golf course opened in 1952 and offers terrific views and challenging play for golfers at every skill level. Well-groomed fairways and greens keep Radnor Valley Country Club difficult yet friendly and we’re looking forward to wrapping up our inaugural season at this top-notch golf course.",
    "round_id": ["7323425497977763184"]
  },
  "7323236350033966326": {
    "name": "Makefield Highlands Golf Club",
    "main_image": "https://workhorsetour.com/images/Makefield%20Highlands/MakefieldHighlands_No14.jpg",
    "images": [
      "https://workhorsetour.com/images/Makefield%20Highlands/MakefieldHighlands_No14a.jpg",
      "https://workhorsetour.com/images/Makefield%20Highlands/MakefieldHighlands_No15.jpg",
      "https://workhorsetour.com/images/Makefield%20Highlands/MakefieldHighlands_No18.jpg",
      "https://workhorsetour.com/images/Makefield%20Highlands/MakefieldHighlands_No9.jpg"
    ],
    "description": "Designed by Rick Jacobson, the links style golf course at Makefield Highlands plays up to 7,058 yards with five sets of tees and has been recognized by Golf Week Magazine as the #9 Golf Course You Can Play in PA. The course also hosts numerous events including the Lower Bucks County Pro-Am and the Golf Association of Philadelphia U.S. Open Qualifier and provides a challenging finish to the season for even the best golfers on Tour. Its practice facilities were also ranked in the Top 50 Public Range Facilities by the Golf Range Association of America, so make sure to get out early for a bucket before tackling this stiff test.",
    "round_id": ["7323425493347251565"]
  },
  "7323229778096469237": {
    "name": "Honeybrook Golf Club",
    "main_image": "https://workhorsetour.com/images/Honeybrook/HoneyB1.jpg",
    "images": [
      "https://workhorsetour.com/images/Honeybrook/HoneyB5.jpg",
      "https://workhorsetour.com/images/Honeybrook/HoneyB7.jpg",
      "https://workhorsetour.com/images/Honeybrook/HoneyB8.jpg",
      "https://workhorsetour.com/images/Honeybrook/HoneyB9.jpg"
    ],
    "description": "Honeybrook is a semi-private golf club nestled among the Amish farms of Chester County, Pennsylvania. Honeybrook offers 18 challenging, yet playable holes that are fun for all skill levels. A mixture of wide-open links, tree-lined fairways and subtle elevation changes that combine natural beauty and great golf, this will be one of the highlights of our inaugural season on Tour. Protected wetlands weave throughout to form breathtaking vistas and memorable target greens. Once you cross the Brandywine Creek to Amish Corner, you'll escape from the outside world and hear nothing but the clip-clop of horse-drawn buggies and the chirping of the birds...and hopefully the sound of your ball filling the bottom of the cup.",
    "round_id": ["7323425484925089128"]
  },
  "7323227096694699252": {
    "name": "The 1912 Club",
    "main_image": "https://workhorsetour.com/images/1912%20Club/1912_No14.jpg",
    "images": [
      "https://workhorsetour.com/images/1912%20Club/1912_No18.jpg",
      "https://workhorsetour.com/images/1912%20Club/1912_No7.jpg",
      "https://workhorsetour.com/images/1912%20Club/1912_No8.jpg"
    ],
    "description": "The site of our second Member outing, The 1912 Club is named after the year of its founding. This private tack is designed by William S. Flynn and offers a beautiful 18-hole Championship Golf Course with a 20,000 square foot Clubhouse that includes two Dining Rooms, the casual 1912 Room and Event & Banquet halls. Sign up for our one-day member outing and experience the course for yourself, as well as numerous other event perks, contests and fun!",
    "round_id": ["7323425479824815461"]
  },
  "7323222344380495091": {
    "name": "Gilbertsville Golf Club (Red/White)",
    "main_image": "https://workhorsetour.com/images/Gilbertsville/Gilbertsville_Blue_No4.jpg",
    "images": [
      "https://workhorsetour.com/images/Gilbertsville/Gilbertsville_White_No1.jpg",
      "https://workhorsetour.com/images/Gilbertsville/Gilbertsville_White_No2.jpg",
      "https://workhorsetour.com/images/Gilbertsville/Gilbertsville_White_No3.jpg"
    ],
    "description": "Gilbertsville Golf Club is a privately owned, 27-hole public golf course. The original 18 holes (red and white courses) were built in 1967, and designed by John Benicasa. The last nine holes (blue nine) completed in 1997 were designed by Jim Blukoyitch. Located in New Hanover Township amidst the rolling hills of Montgomery County, Gilbertsville Golf Club offers golfers both a traditional look, with small flat greens and tree-lined fairways on the red and white courses, as well as a more modern look with rolling fairways, challenging lies and large undulated greens on the blue course. After completion of your round, come inside and watch a sporting event on the big screen television, or sit out on the deck and enjoy the scenic views. ",
    "round_id": ["7323425476637144419"]
  },
  "7323217916269212914": {
    "name": "Hickory Valley (Presidential)",
    "main_image": "https://workhorsetour.com/images/Hickory%20Valley/Presidential/HV_Presidential_No14.jpg",
    "images": [
      "https://workhorsetour.com/images/Hickory%20Valley/Presidential/HV_Presidential_No2.jpg",
      "https://workhorsetour.com/images/Hickory%20Valley/Presidential/HV_Presidential_No4.jpg",
      "https://workhorsetour.com/images/Hickory%20Valley/Presidential/HV_Presidential_No6.jpg"
    ],
    "description": "The location of our third Major, The Presidential first will capture your imagination as it escorts guests across wide fairways, large undulating greens and a vast array of bunkers, lakes and environmentally sensitive areas. Including the signature Par 4 second hole, a 450-yard gentle dogleg to the right that requires a long and accurate tee shot, setting up a carry to bunkered green guarded on the right by a large pond. As you make the turn to the back nine, the course tightens just a bit, as the layout meanders through tall mature hardwoods to more smallish greens that require shot-making and just a hint of clean living. The closing on the Presidential can be most challenging and require your undivided attention, as you may be faced with three of the best finishing holes you’ll find anywhere.",
    "round_id": ["7323425474724541794", "7323425483012486503"]
  },
  "7323216705658860785": {
    "name": "Hickory Valley (Ambassador)",
    "main_image": "https://workhorsetour.com/images/Hickory%20Valley/Ambassador/HV_Ambassador_No10.jpg",
    "images": [
      "https://workhorsetour.com/images/Hickory%20Valley/Ambassador/HV_Ambassador_No11.jpg",
      "https://workhorsetour.com/images/Hickory%20Valley/Ambassador/HV_Ambassador_No15.jpg",
      "https://workhorsetour.com/images/Hickory%20Valley/Ambassador/HV_Ambassador_No16.jpg"
    ],
    "description": "Although shorter in length at 6,450 yards than its sibling, the elder statesmen Ambassador more than makes up for it in a classic mature design. What seems benign on the scorecard is not the case, as the routing weaves its way through massive 70-foot high hardwoods to gently rolling greens that slope from back to front. Continuously praised from both the occasional and the accomplished golfer, the Ambassador is a course for all ages and levels of ability. The Ambassador offers impeccably conditioned fairways and some of the smallest and smoothest putting surfaces in the region. Ever the cordial diplomat, The Ambassador does have its own version of “golf hardball”, including the 610-yard par-5 9th hole and the 465-yard par-4 13th, where many a quality round has gone astray.",
    "round_id": ["7323425478247757156"]
  },
  "7323215202185426160": {
    "name": "Talamore Country Club",
    "main_image": "https://workhorsetour.com/images/Talamore/IMG_1158.JPG",
    "images": [
      "https://workhorsetour.com/images/Talamore/TAL18%20Painting.jpg",
      "https://workhorsetour.com/images/Talamore/Talamore1.gif",
      "https://workhorsetour.com/images/Talamore/Talamore_No3.jpg",
      "https://workhorsetour.com/images/Talamore/Talamore_No9.jpg",
      "https://workhorsetour.com/images/Talamore/Talamore_No9a.jpg"
    ],
    "description": "The location for our first Workhorse Tour member outing, the golf course at Talamore is one of breathtaking views and exciting shots. Challenging for low handicappers and fun-filled for all players as it features six sets of tees, Talamore is perhaps most known for its visually stimulating and unique to the area “Low country” feel with its expansive wetlands and beautiful native areas of Pennsylvania. Sign up for our one-day member outing and experience the course for yourself, as well as numerous other event perks, contests and fun!",
    "round_id": ["7323425472979711329"]
  },
  "7323213672338207983": {
    "name": "Jeffersonville Golf Club",
    "main_image": "https://workhorsetour.com/images/Jeffersonville/Jeff10.jpg",
    "images": [
      "https://workhorsetour.com/images/Jeffersonville/Jeff11.jpg",
      "https://workhorsetour.com/images/Jeffersonville/Jeff6.jpg",
      "https://workhorsetour.com/images/Jeffersonville/Jeff7.jpg"
    ],
    "description": "The host of our second Major on Tour, Jeffersonville Golf Club is an 18-hole, par-70 public course, owned and operated by West Norriton Township. Opened in 1931, Jeffersonville was designed by legendary architect Donald J. Ross and is consistently ranked among the top-10 public golf courses in Pennsylvania. In 2000, the course was restored and modernized by Ron Pritchard, a locally-based architect who specializes in restoring the works of the design master Ross. Having played host to many prestigious tournaments and championships over the years, including the U.S.G.A United States Amateur Public Links Championships Sectional Qualifier on two occasions, Jeffersonville is a must stop on Tour.",
    "round_id": ["7323425469825594719"]
  },
  "7323212739424335086": {
    "name": "Kimberton Golf Club",
    "main_image": "https://workhorsetour.com/images/Kimberton/2ndHoleGreen.jpg",
    "images": [
      "https://workhorsetour.com/images/Kimberton/IMG_4626.JPG",
      "https://workhorsetour.com/images/Kimberton/Kim3.jpg",
      "https://workhorsetour.com/images/Kimberton/Kimb1.jpg"
    ],
    "description": "For over 50 years, Kimberton Golf Club in Phoenixville, Pennsylvania, has welcomed golfers to play the course, designed by renowned architect George Fazio. Known as a location for golf the whole family can enjoy, each year new golfers are tested by our challenging 18-hole layout. Beyond the golf, Kimberton has a large banquet facility available for rentals and a stellar 19th hole hangout at the Roundhouse Bar & Grill.",
    "round_id": ["7323425468080764254"]
  },
  "7323210812091315437": {
    "name": "Spring Hollow Golf Club",
    "main_image": "https://workhorsetour.com/images/Spring%20Hollow/SpringHollow_No14.jpg",
    "images": [
      "https://workhorsetour.com/images/Spring%20Hollow/SpringHollow_No15.jpg",
      "https://workhorsetour.com/images/Spring%20Hollow/SpringHollow_No18.jpg",
      "https://workhorsetour.com/images/Spring%20Hollow/SpringHollow_No8.jpg",
      "https://workhorsetour.com/images/Spring%20Hollow/SpringHollow_No9.jpg"
    ],
    "description": "Opened in 1993 in the hills of northern Chester County, architect John Thompson created a layout that blends in the features of this one-time dairy farm. The par-70, 6008-yard layout has five par threes, three par fives and ten par fours which results in a variety of shots. Meadows that define some of the holes were left in place and they give the course a natural look and feel. From one side of the course to the other, there is a 110-foot change in elevation. Water hazards in the form of wetlands, creeks, and ponds come into play on six of the holes. The frequent and often dramatic elevation changes afford the players not only challenging shot selections, but also beautiful views of the surrounding area.",
    "round_id": ["7323425466201716061"]
  },
  "7323181876795978988": {
    "name": "Coeur D'Alene Golf Club",
    "main_image": "blah",
    "images": ["blah"],
    "description": "blah blah",
    "round_id": ["7323425464054232412"]
  },
  "7323168754932692203": {
    "name": "Five Ponds Golf Club",
    "main_image": "https://workhorsetour.com/images/Five%20Ponds/FivePonds_No1.jpg",
    "images": [
      "https://workhorsetour.com/images/Five%20Ponds/FivePonds_No18.jpg",
      "https://workhorsetour.com/images/Five%20Ponds/FivePonds_No3.jpg",
      "https://workhorsetour.com/images/Five%20Ponds/FivePonds_No6.jpg"
    ],
    "description": "One of Bucks County’s top courses, Warminster's Five Ponds Golf Club is an 18-hole facility which features five sets of tees ranging from 5300 yards to 6670 yards, a grass and mats driving range, and a 7000-square foot putting green. The course offers terrific views and challenging play for golfers at every skill level, while well-groomed fairways and greens keep the course difficult yet friendly.",
    "round_id": ["7323425455262971225"]
  },
  "7195613714035291331": {
    "name": "Raven's Claw Golf Club",
    "main_image": "https://workhorsetour.com/images/Raven_s%20Claw/Ravens%20Claw.jpg",
    "images": [
      "https://workhorsetour.com/images/Raven_s%20Claw/RavensClaw_No11.jpg",
      "https://workhorsetour.com/images/Raven_s%20Claw/RavensClaw_No14.jpg",
      "https://workhorsetour.com/images/Raven_s%20Claw/RavensClaw_No3.jpg",
      "https://workhorsetour.com/images/Raven_s%20Claw/RavensClaw_No9.jpg"
    ],
    "description": "Opened in 2005, Raven’s Claw Golf Club has enjoyed an incredible reception onto the stage of Pennsylvania golf and beyond. The par-71 golf course east of Pottstown, Pennsylvania measures over 6,700 yards from the back tees and was designed by Ed Shearon. The course has been recognized by Golf Digest as one of the Top New Courses in the United States and Golfweek has ranked Raven’s Claw in the Top Ten in Pennsylvania. Demanding, yet fair, this course is the perfect host for our inaugural Workhorse Tour event.",
    "round_id": ["7323270116395758911"]
  },
  "7323158365977228522": {
    "name": "Macoby Run Golf Course",
    "main_image": "https://workhorsetour.com/images/Macoby%20Run/Macoby%20Run.jpg",
    "images": [
      "https://workhorsetour.com/images/Macoby%20Run/MacobyRun_No15.jpg",
      "https://workhorsetour.com/images/Macoby%20Run/MacobyRun_No16.jpg",
      "https://workhorsetour.com/images/Macoby%20Run/MacobyRun_No3.jpg",
      "https://workhorsetour.com/images/Macoby%20Run/MacobyRun_No9.jpg"
    ],
    "description": "Utilizing the naturally rolling terrain and woods of upper Montgomery County farm country, Macoby Run Golf Course offers an excellent variety of challenges to compliment the breathtaking vistas you will experience throughout your round. The front nine holes have 138′ of elevation change with hills and trees to keep you on top of your game. The back nine holes offer a bit of a reprieve with slightly less hilly and more open terrain. No two greens are the same and the two-tier green on #3 will challenge the truest putting skills. After your round, be sure to check out the pavilion and Wetlands Bar & Restaurant for a cold beer and bite to eat!",
    "round_id": ["7323422444893549912", "7323425471402653024"]
  },
  "7195632995552769220": {
    "name": "Turtle Creek Golf Course",
    "main_image": "https://workhorsetour.com/images/Turtle%20Creek/TurtleCreek_No1.jpg",
    "images": [
      "https://workhorsetour.com/images/Turtle%20Creek/TurtleCreek_No16.jpg",
      "https://workhorsetour.com/images/Turtle%20Creek/TurtleCreek_No17.jpg",
      "https://workhorsetour.com/images/Turtle%20Creek/TurtleCreek_No18.jpg"
    ],
    "description": "The recipient of a 4.5-star rating by Golf Digest in its “Best Places to Play”, Turtle Creek was one of only two courses in the area to receive this honor. Known for its well-manicured, wide open fairways and huge greens, the course is enjoyable for golfers of all levels, but far more challenging than it would appear at first glance. As Golf Digest put it, “One of the best maintained courses in the area…with the best turf of any course in the Northeast”, this venue makes the perfect spot for our fourth and final Major Tournament.",
    "round_id": ["7323425491870856556"]
  },
  "7195634105365607621": {
    "name": "Worcester Golf Club",
    "main_image": "https://workhorsetour.com/images/Worcester/Worcester_No2.jpg",
    "images": [
      "https://workhorsetour.com/images/Worcester/Worcester_No7.jpg",
      "https://workhorsetour.com/images/Worcester/Worcester_No8.jpg",
      "https://workhorsetour.com/images/Worcester/Worcester_No9.jpg"
    ],
    "description": "Our first 9-hole tournament on Tour, Worcester Golf Club spans a total of 3,047 yards from the longest tees and clocks in at a brisk par-35. Worcester manages the difficult double task of challenging experienced golfers while helping rookies relax and enjoy the scenery as they learn this classic game. The golf facility, in addition to the popular 9-hole course, features a practice green and warm up range with grass tee boxes and the tavern in the clubhouse is an ideal spot to unwind after your round.",
    "round_id": ["7323425459021067611"]
  },
  "7195634781118313670": {
    "name": "Landis Creek Golf Club",
    "main_image": "https://workhorsetour.com/images/Landis%20Creek/Landis%20Creek.jpg",
    "images": [
      "https://workhorsetour.com/images/Landis%20Creek/LandisCreek_No1.jpg",
      "https://workhorsetour.com/images/Landis%20Creek/LandisCreek_No12.jpg",
      "https://workhorsetour.com/images/Landis%20Creek/LandisCreek_No14.jpg",
      "https://workhorsetour.com/images/Landis%20Creek/LandisCreek_No15.jpg"
    ],
    "description": "Home to our first Major, golfers who know a challenge know this beautifully manicured Montgomery County 18-hole championship course. It’s delightfully flat fairways and generous greens make playing the course a real pleasure but sand traps on each hole and the tricky back-nine provide a consistent challenge for low and high handicaps alike. Built on rolling terrain and featuring tree-lined fairways, the undulating greens are very well maintained, and water hazards are most definitely in play. The clubhouse offers a spectacular view of the course and an extremely scenic pond, and is the perfect place to enjoy a few cold beers.",
    "round_id": ["7323425457041356122"]
  },
  "7195635573372007623": {
    "name": "Lederach Golf Club",
    "main_image": "https://workhorsetour.com/images/Lederach/Lederach1.jpg",
    "images": [
      "https://workhorsetour.com/images/Lederach/Lederach4.jpg",
      "https://workhorsetour.com/images/Lederach/Lederach_No2.jpg"
    ],
    "description": "The site of our Tour Championship, Lederach Golf Club’s difficulty won’t be found in forced carries or other modern design gimmicks. Rather, the course will utilize the property’s ample undulations, scenic ridges, and sweeping valleys. False fronts, collection areas, grass bunkers, and swales are just some of the natural hazards incorporated into this “land-based” design at Lederach. The layout features tees specifically for junior players, as well as four other sets ranging in distances of 4,989 to 7,023 yards. With holes allowing players to run out drives or chase approaches to greens, as well as a tee box to suit the lengths and strengths of any player, Lederach is an instant classic on the region’s golf scene.",
    "round_id": ["7323425481334764902", "7323425496501368175"]
  },
  "7195638802516325577": {
    "name": "Linfield National Golf Club",
    "main_image": "https://workhorsetour.com/images/Linfield%20National/LinfieldNational_No18.jpg",
    "images": [
      "https://workhorsetour.com/images/Linfield%20National/LinfieldNational_No2.jpg",
      "https://workhorsetour.com/images/Linfield%20National/LinfieldNational_No3.jpg"
    ],
    "description": "Linfield National Golf Club is a traditional course featuring a top-tier layout, gorgeous natural scenery and the luxurious amenities expected from long-time purveyors of this classic game. The biggest draw for Linfield National Golf Club is the unique layout which combines the elements of a links-style course with the traditional characteristics of water, trees and changing elevations. Play at Linfield National spans 6,164 yards, but the multiple sets of tees make this a great round for a wide range of players, from the novice right on up to the seasoned pro.",
    "round_id": ["7323425490327352683"]
  }
}
